package days19;

public class Ex05 {

	public static void main(String[] args) {
		/*
		 * 
		 * 5. 장점 2가지
		 *    ㄱ. 접근성-클래스멤버+내부클래스 호출
		 *    ㄴ. 보안성
		 *    class A {
		 *       int x;
		 *       static int y;
		 *       B obj = new B();    		 *         
		 *         //내부클래스
		 *         private class B{
		 *             //외부 클래스의 필드, 메서드 접근 가능
		 *         }
		 *     }
		 * 6. 내부 클래스의 종류 및 특징 - 선언된 위치 기준
		 *   ㄱ. 인스턴스 클래스 - 외부클래스 필드 선언 위치, 외부클래스의 인스턴스 멤버처럼 사용
		 *   ㄴ. 스테틱 클래스 - 외부클래스 필드 선언 위치, 외부클래스의 static 멤버처럼 사용
		 *   ㄷ. 지역 클래스 - 메서드, 초기화 블럭 안에 선언, 사용
		 *   ***ㄹ. 익명 클래스 - 클래스 선언+생성, 클래스 이름x, 일회성클래스
		 *p. 405-409 정독 + 코딩
		 */

	}

}
