package days12;
/**
 * @author 이채영
 * @date 2022. 3. 4. - 오후 4:22:07
 * @subject  다차원 배열의 초기화
 * @content 
 */
public class Ex11_03 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

		/*
	     int [] m = new int [8];
		m[0] = 1;
		m[1] = 2;
		m[2] = 3;
		m[3] = 4;
		m[4] = 5;
		m[5] = 6;
		m[6] = 7;
		m[7] = 8;
		
		//1차원배열 초기화
		int [] m = new int [] {1,2,3,4,5,6,7,8};
		int [] m = {1,2,3,4,5,6,7,8};
		 */
		/*2차원배열 초기화
		int [][] m= new int [2][4];
		m[0][0]=1; m[0][1]=2; m[0][2]=3; m[0][3]=4;
		m[1][0]=5; m[1][1]=6; m[1][2]=7; m[1][3]=8;
		
		int [][] m = new int [][] { 
												{1,2,3,4},
												{5,6,7,8}
											 };
	    int [][]m = { {1,2,3,4},{5,6,7,8}};
		
		*/
		/*3차원배열 초기화
		int [][][] m= new int [2][2][2];
		m[0][0][0]=1; m[0][0][1]=2; 
		m[0][1][0]=3; m[0][1][1]=4;
		
		
		m[1][0][0]=5; m[1][0][1]=6;
		m[1][1][0]=7; m[1][1][1]=8;
		
		int [][][] m = new int [][][] {
		                                              {
														{1,2},
														{3,4}
												},
												 { {5,6},{7,8}}
											 };
	    int [][]m = { {{1,2},{3,4}},{{5,6},{7,8}}};
		
		*/
		
	}

}
