package days11;

public class Ex04 {

	public static void main(String[] args) {
		// chapter5 배열. p. 182
	/*	[참조형-배열, 클래스, 인터페이스]
		 1. 배열의 정의? 같은 타입의 여러 변수를 하나의 묶음으로 다루는 것 
		 *                     동일한 자료형이 메모리 상에 연속적으로 놓이게 한 것 
		 * 2. 배열 선언 형식
		 *    자료형 [] 배열명;
		 *    자료형 배열명 [];   //배열명을 변수, 참조변수 라고도 한다.
		 * 3. 배열 생성 형식   -> new 연산자를 사용해서 힙(동적)영역에 실제 기억공간이 할당되고
		 *                             그 시작주소를 배열명이 참조한다.
		 *   배열명 = new 자료형[배열크기]
		 * 
		 * 4. [] 인덱스(index) 연산자를 설명 - 배열
		 *                         국어점수
		 * 5. 배열의 요소
		 *      첨자값 == index인덱스
		 *      0번재요소           배열명 [0]
		 * 6. 배열크기 = 배열명.length
		 * 7. 배열의 길이 변경 p.189    Ex04_02
		 * 
		 * 8. 배열의 초기화 
		 * 9. 배열을 초기화하지않으면 각 자료형의 기본값으로 초기화되어져있다.
		 *    ex. int []m=new int [3]
		 *       m[0]=0;
		 *       m[1]=0;
		 *       m[2]=0;
		 */
	}

}
