package days03;

/**
 * @author 이채영
 * @date 2022. 2. 17. - 오후 4:18:16
 * @subject  연산자
 * @content  p.86(연산자) operator
 */
public class Ex09 {

	public static void main(String[] args) {
		/* 1.연산자 정의? 연산을 수행하는 기호 +,-,*,/
		 * 2. 덧셈연산자    3+5
		 *   피연산자(operand)? 연산자의 작업대상(변수, 상수, 리터럴, 수식)
		 *  3. 연산자의 종류
		 *   [기능]
		 *     ㄱ. 산술연산자   Ex09_02.java
		 *     ㄴ. 비교연산자   Ex09_03.java
		 *     ㄷ. 논리연산자   
		 *         1) 일반논리연산자 : !  &&   ||        Ex09_04.java
		 *         2) 비트논리연산자 : ~   &   |   ^     
		 *      
		 *     ㄹ. 대입연산자
		 *     ㅁ. 기타연산자
		 *     ㅂ. 쉬프트 연산자 >>  <<    >>>
		 *   
		 *   [피연산자의 갯수]
		 *   ㄱ.단항 연산자
		 *   ㄴ.이항 연산자
		 *   ㄷ. 삼항 연산자 
		 *     
		 *     
		 * 
		 */

	}

}
